{
  "profileData": {
    "name": "Shakir M. Shaker",
    "title": "AI Engineer",
    "location": "Copenhagen, Denmark",
    "email": "shakir.m.shaker@gmail.com",
    "phone": "+45 50 41 42 87",
    "linkedin": "www.linkedin.com/in/shakir-m-shaker-3212a8168",
    "bio": "I build AI systems that solve real problems. Over the past few years, I've taken companies from having no AI to running it across their operations - from web agents handling customer inquiries to ML models predicting patient outcomes. I'm hands-on technical but also comfortable working with leadership to figure out where AI actually makes sense."
  },
  "technicalSkills": [
    {
      "category": "AI & Machine Learning",
      "skills": [
        "LLM Implementation",
        "RAG Systems Development",
        "Machine Learning Model Development"
      ]
    },
    {
      "category": "Backend Development",
      "skills": [
        "LLM Application Architecture",
        "API Development",
        "Web Application Backend"
      ]
    },
    {
      "category": "Data Engineering",
      "skills": [
        "Postgres & Snowflake",
        "PowerBI & Tableau",
        "Pandas & Spark"
      ]
    }
  ],
  "experience": [
    {
      "title": "Head of AI",
      "company": "Modstrøm",
      "period": "2023 - Present",
      "description": "- Joined when the company had zero AI - now it runs through most of what we do\n- Architected and deployed web agents on our websites that handle both lead generation and customer support autonomously\n- Built an automatic email drafting system for customer service that now generates 4,000+ email drafts monthly\n- Led the call transcription project - we use it to spot trends, extract action items, flag follow-ups, and catch unhappy customers before they churn\n- Work directly with the C-suite to decide where AI fits and where it doesn't"
    },
    {
      "title": "Founder",
      "company": "Lexii",
      "period": "2023 - Present",
      "description": "- Built an AI email client from scratch - handles everything from understanding context to drafting replies\n- Currently used by 50+ daily active users\n- Did all the technical work myself: backend, frontend, LLM integration, and deployment"
    },
    {
      "title": "AI Engineer",
      "company": "Medley VC",
      "period": "2022 - 2023",
      "description": "Worked across portfolio companies to find where AI could actually help. Built tools for business intelligence and energy recommendations. Spent a lot of time helping teams understand what AI can and can't do - important when expectations are high."
    },
    {
      "title": "Research Assistant",
      "company": "Hvidovre Hospital",
      "period": "2022",
      "description": "Built ML models to predict mortality risk in acutely hospitalized patients. Led the technical work and data analysis. The research got published - one of those projects where the models actually have a chance to help real patients."
    },
    {
      "title": "Associate",
      "company": "KPMG",
      "period": "2021 - 2022",
      "description": "Consulted on AI and data projects for large clients. Helped them figure out which problems were actually worth solving with AI, then built the tools to do it. Learned a lot about how big organizations adopt (or resist) new technology."
    }
  ],
  "education": [
    {
      "degree": "Master of Engineering - Human-Centered Artificial Intelligence",
      "school": "Technical University of Denmark",
      "period": "",
      "description": "Focused on AI, human interaction, and LLMs. Did this in 2 years while working full-time. Thesis: 12/12, GPA: 10.1/12"
    },
    {
      "degree": "Bachelor of Science - Data Science",
      "school": "IT University of Copenhagen",
      "period": "",
      "description": "Machine learning, data visualization, statistics. Finished in 1 year and 9 months."
    }
  ],
  "lastSaved": "2025-09-24T07:14:47.519Z",
  "_metadata": {
    "fetchedAt": "2025-09-24T07:08:21.231Z",
    "source": "github-api",
    "sha": "b1152e01b4b83d70146f644a09aaffd3b96a8a91"
  }
}